{
    "navbar.link1": "Características",
    "navbar.link2": "Portafolio",
    "navbar.link3": "Contacto",
    "header.subTitle": "Desarrollador Front End  / Desarrollador Back End",
    "header.paragraph": "Especializado en desarrollo Back End y programación de aplicaciones web M.E.A.N. stack y M.E.R.N. stack. Si eres una empresa que busca presencia en la web o está buscando contratar",
    "header.link": "contactame",
    "header.button": "Ver portafolio",
    "features.title1": "Desarrollador Front End",
    "features.title2": "Desarrollador Back End",
    "features.title3": "Desarrollador Back End",
    "features.paragraph1": "Creación de aplicaciones web personalizadas con diseño receptivo, S.E.O y buenas experiencias web para el usuario.",
    "features.paragraph2": "Creación bases de datos seguras y API que sean eficientes, estables, de ejecución rápida y seguras contra amenazas externas.",
    "features.paragraph3": "Totalmente receptivo, interactivo y completo diseño y desarrollo personalizado de sitios web de Webflow.",
    "features.subtitle": "Trabajo con",
    "features.subparagraph1": "HTML, CSS, Javascript, Typescript, Angular, Reactjs, JQuery, AJAX y desarrollo de API.",
    "features.subparagraph2": "NodeJs, Express, MongoDB, Firebase, Firestore and desarrollo de API.",
    "features.subparagraph3": "HTML, CSS, Javascript, Webflow CMS, alojamiento en Webflow, interacciones en Webflow.",
    "portfolio.title": "Mi Trabajo",
    "portfolio.pargraph1": "Shikhman es una página web construida con el stack M.E.A.N con el propósito de que el usuario pueda crear, editar y guardar colecciones de fotos o videos de manera personalizada, mostrándolos en su propio perfil.",
    "portfolio.pargraph2": "Spark fue una página web construida con Angular y Firebase, como back-end, su objetivo principal es utilizar el GPT-3 construido por OpenAI API para generar ideas de trabajo.",
    "portfolio.btnPreview": "Ver demostración",
    "portfolio.btnSeeMore": "Ver más",
    "portfolioModal1.paragraph1": "Este sitio web está construido con el M.E.A.N stack que se refiere a:",
    "portfolioModal1.btnclose": "Cerrar",
    "portfolioModal1.featurep1": "como base de datos NoSQL",
    "portfolioModal1.featurep2": "el marco de trabajo del back-end",
    "portfolioModal1.featurep3": "el marco de trabajo del front-end",
    "portfolioModal1.featurep4": "el entorno de ejecución de JavaScript en el back-end",
    "portfolioModal1.pargraph2": "Esta página contiene contenido altamente personalizado donde el usuario puede editar, crear o eliminar colecciones, obras, perfil, enlaces a redes sociales, banners, avatares, imágenes y videos. También contiene un sistema de administración, roles de usuario y ban, donde dependiendo del rol que tengas, tendrás acceso total o no a todas las páginas de este sitio web.",
    "portfolioModal2.paragraph1": "Este sitio web está construido con:",
    "portfolioModal2.featurep1": "la plataforma para el desarrollo del back-end y la autenticacion de usuarios",
    "contact.title": "Ponerse en Contacto",
    "contact.inputName": "Nombre",
    "contact.inputEmail": "Correo",
    "contact.inputSubject": "Tema",
    "contact.inputMessage": "Mensaje",
    "contact.nameInvalid": "Se requiere un nombre válido.",
    "contact.emailInvalid": "Por favor, introduce una dirección de correo electrónico válida.",
    "contact.subjectInvalid": "Su tema es requerido",
    "contact.messageInvalid": "Su mensaje es requerido",
    "contact.btn": "Enviar mensaje"
}